cf_billing/Documents/энргРасчетДебиторскойЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргРасчетДебиторскойЗадолженности</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргЗначенияПлощадей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияПлощадей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Площадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоКомнат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоКомнат</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргКоличествоПрописанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКоличествоПрописанных</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеТочекУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоТП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/энргРасчетДебиторскойЗадолженности/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
			
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст
//                           ошибки).
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя
//                           области в которой был выведен объект).
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "энргРасчетДебиторскойЗадолженности") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
						КоллекцияПечатныхФорм,
						"энргРасчетДебиторскойЗадолженности", НСтр("ru = 'Расчет дебиторской задолженности'"),
						СформироватьМакет(ПараметрыПечати.ПараметрыОтчета, ОбъектыПечати), ,
						"Документ.энргРасчетДебиторскойЗадолженности.энргРасчетДебиторскойЗадолженности");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Сформировать печатные формы объектов.
// 
// Параметры:
//   ПараметрыОтчета 	- Параметры отчета.
//   ОбъектыПечати		- Объекты печати.
//
Функция СформироватьМакет(ПараметрыОтчета,ОбъектыПечати) Экспорт 
	
	ТабДок 						= Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ПараметрыПечати_энргРасчетДебиторскойЗадолженности";
	
	Макет 						= Документы.энргРасчетДебиторскойЗадолженности.ПолучитьМакет("энргРасчетДебиторскойЗадолженности");
	
	ОбластьШапка 				= Макет.ПолучитьОбласть("Шапка");
	ОбластьСправочно 			= Макет.ПолучитьОбласть("Справочно");
	ОбластьУслуга 				= Макет.ПолучитьОбласть("Услуга");
	ОбластьЗаголовокПУ 			= Макет.ПолучитьОбласть("ЗаголовокПУ");
	ОбластьПУ 					= Макет.ПолучитьОбласть("ПУ");
	ОбластьСальдо 				= Макет.ПолучитьОбласть("Сальдо");
	ОбластьМесяцДанных 			= Макет.ПолучитьОбласть("МесяцДанных");
	ОбластьДанные 				= Макет.ПолучитьОбласть("Данные");
	ОбластьИтогДанныхЗаМесяц 	= Макет.ПолучитьОбласть("ИтогДанныхЗаМесяц");
	ОбластьПодвал 				= Макет.ПолучитьОбласть("Подвал");	
	
	ЗаполнитьШапку(ПараметрыОтчета,ОбластьШапка);
	ТабДок.Вывести(ОбластьШапка);
	
	ЗаполнитьСправочно(ПараметрыОтчета,ОбластьСправочно);
	ТабДок.Вывести(ОбластьСправочно);

	ЗаполнитьУслуги(ПараметрыОтчета,ОбластьУслуга,ТабДок);
	
	ТабДок.Вывести(ОбластьЗаголовокПУ);
	
	ЗаполнитьПУ(ПараметрыОтчета,ОбластьПУ,ТабДок);
	
	ОбластьСальдо.параметры.Сальдо = ПараметрыОтчета.СуммаЗадолженности;
	ТабДок.Вывести(ОбластьСальдо);
	
	ОбластьДанные(ПараметрыОтчета,ОбластьМесяцДанных);
	ДопОбласти(ПараметрыОтчета,ТабДок);
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

Процедура ОбластьДанные(ПараметрыОтчета,ОбластьМесяцДанных)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(энргВзаиморасчетыОстаткиИОбороты.СуммаОборот, 0)) КАК Сальдо,
		|	ЕСТЬNULL(энргВзаиморасчетыОстаткиИОбороты.СуммаПриход, 0) КАК Начислено,
		|	ЕСТЬNULL(энргВзаиморасчетыОстаткиИОбороты.СуммаРасход, 0) КАК Оплачено,
		|	энргВзаиморасчетыОстаткиИОбороты.Абонент КАК Абонент,
		|	энргВзаиморасчетыОстаткиИОбороты.Регистратор,
		|	НАЧАЛОПЕРИОДА(энргВзаиморасчетыОстаткиИОбороты.Период, МЕСЯЦ) КАК Месяц
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчеты.ОстаткиИОбороты(&НачПериод, &КонПериод, Регистратор, , Абонент = &Абонент) КАК энргВзаиморасчетыОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВзаиморасчетыОстаткиИОбороты.Абонент,
		|	энргВзаиморасчетыОстаткиИОбороты.Регистратор,
		|	ЕСТЬNULL(энргВзаиморасчетыОстаткиИОбороты.СуммаПриход, 0),
		|	ЕСТЬNULL(энргВзаиморасчетыОстаткиИОбороты.СуммаРасход, 0),
		|	НАЧАЛОПЕРИОДА(энргВзаиморасчетыОстаткиИОбороты.Период, МЕСЯЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Месяц
		|ИТОГИ
		|	СУММА(Сальдо),
		|	СУММА(Начислено),
		|	СУММА(Оплачено)
		|ПО
		|	Абонент,
		|	Месяц";
	
	Запрос.УстановитьПараметр("Абонент", 	ПараметрыОтчета.Абонент);
	Запрос.УстановитьПараметр("КонПериод",	ПараметрыОтчета.КонПериода);
	Запрос.УстановитьПараметр("НачПериод", 	ПараметрыОтчета.НачПериода);
	
	РезультатЗапроса 							= Запрос.Выполнить();
	
	ВыборкаАбонент 								= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Сальдо 										= 0;
	Пока ВыборкаАбонент.Следующий() Цикл
		// Итоги Абонента
	    Сальдо 									= ВыборкаАбонент.Сальдо;
		ВыборкаМесяц 							= ВыборкаАбонент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаМесяц.Следующий() Цикл
			// Итоги по Месяцам
	        ОбластьМесяцДанных.Параметры.Месяц 	= "" + Строка(Месяц(ВыборкаМесяц.Месяц)) + " " + Строка(Год(ВыборкаМесяц.Месяц)) + " г.";
			ВыборкаДетальныеЗаписи 				= ВыборкаМесяц.Выбрать();
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// ДетальныеЗаписи
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла; 
КонецПроцедуры

Процедура ДопОбласти(ПараметрыОтчета,ТабДок) 
	
	Макет 	= Документы.энргРасчетДебиторскойЗадолженности.ПолучитьМакет("энргРасчетДебиторскойЗадолженности1");
	Запрос 	= Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(энргЗначенияПлощадей.Период, МЕСЯЦ) КАК Период,
	|	энргЗначенияПлощадей.Регистратор КАК Регистратор,
	|	энргЗначенияПлощадей.Абонент,
	|	энргЗначенияПлощадей.Площадь КАК Количество,
	|	""Площадь"" КАК Описание
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.энргЗначенияПлощадей КАК энргЗначенияПлощадей
	|ГДЕ
	|	энргЗначенияПлощадей.Абонент = &Абонент
	|	И энргЗначенияПлощадей.Период МЕЖДУ &НачПериод И &КонПериод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(энргКоличествоКомнат.Период, МЕСЯЦ),
	|	энргКоличествоКомнат.Регистратор,
	|	энргКоличествоКомнат.Абонент,
	|	энргКоличествоКомнат.Количество,
	|	""Комнаты""
	|ИЗ
	|	РегистрСведений.энргКоличествоКомнат КАК энргКоличествоКомнат
	|ГДЕ
	|	энргКоличествоКомнат.Абонент = &Абонент
	|	И энргКоличествоКомнат.Период МЕЖДУ &НачПериод И &КонПериод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(энргКоличествоПрописанных.Период, МЕСЯЦ),
	|	энргКоличествоПрописанных.Регистратор,
	|	энргКоличествоПрописанных.Абонент,
	|	энргКоличествоПрописанных.Количество,
	|	""Кол-во прописанных""
	|ИЗ
	|	РегистрСведений.энргКоличествоПрописанных КАК энргКоличествоПрописанных
	|ГДЕ
	|	энргКоличествоПрописанных.Период МЕЖДУ &НачПериод И &КонПериод
	|	И энргКоличествоПрописанных.Абонент = &Абонент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(энргСостояниеЛС.Период, МЕСЯЦ),
	|	энргСостояниеЛС.Регистратор,
	|	энргСостояниеЛС.Абонент,
	|	энргСостояниеЛС.Состояние,
	|	""Состояние ЛС""
	|ИЗ
	|	РегистрСведений.энргСостояниеЛС КАК энргСостояниеЛС
	|ГДЕ
	|	энргСостояниеЛС.Период МЕЖДУ &НачПериод И &КонПериод
	|	И энргСостояниеЛС.Абонент = &Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Период КАК Период,
	|	ВТ_Данные.Регистратор,
	|	ВТ_Данные.Абонент,
	|	ВТ_Данные.Количество,
	|	ВТ_Данные.Описание
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("Абонент", 	ПараметрыОтчета.Абонент);
	Запрос.УстановитьПараметр("КонПериод", 	ПараметрыОтчета.КонПериода);
	Запрос.УстановитьПараметр("НачПериод", 	ПараметрыОтчета.НачПериода);
	
	РезультатЗапроса 						= Запрос.Выполнить();
	
	ОбластьЗаголовок 						= Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал 							= Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы 					= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы 					= Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей					= Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаДетальныеЗаписи 					= РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	КонецЦикла;  
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);	
КонецПроцедуры

Процедура ЗаполнитьШапку(ПараметрыОтчета,ОбластьШапка)
	  		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК ФизЛицо,
		|	ФизическиеЛица.ДатаРождения
		|ПОМЕСТИТЬ ВТ_ФизЛицо
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Наименование = &Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокументыФизическихЛицСрезПоследних.Серия,
		|	ДокументыФизическихЛицСрезПоследних.Номер,
		|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи,
		|	ВТ_ФизЛицо.ДатаРождения,
		|	ДокументыФизическихЛицСрезПоследних.КемВыдан
		|ИЗ
		|	ВТ_ФизЛицо КАК ВТ_ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
		|				&Дата,
		|				ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)
		|					И Физлицо В
		|						(ВЫБРАТЬ
		|							ВТ_ФизЛицо.ФизЛицо
		|						ИЗ
		|							ВТ_ФизЛицо КАК ВТ_ФизЛицо)) КАК ДокументыФизическихЛицСрезПоследних
		|		ПО ВТ_ФизЛицо.ФизЛицо = ДокументыФизическихЛицСрезПоследних.Физлицо";
	
	Запрос.УстановитьПараметр("Дата", 			ПараметрыОтчета.Дата);
	Запрос.УстановитьПараметр("Наименование", 	Строка(ПараметрыОтчета.Абонент));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьШапка.Параметры.Серия 	 		= Выборка.Серия;
		ОбластьШапка.Параметры.Номер 			= Выборка.Номер;
		ОбластьШапка.Параметры.Выдан 			= Выборка.КемВыдан;
		ОбластьШапка.Параметры.ДатаВыдачи 		= Выборка.ДатаВыдачи;
		ОбластьШапка.Параметры.ДатаРождения 	= Выборка.ДатаРождения;
		ОбластьШапка.Параметры.МестоРождения 	= "?";
	КонецЦикла;
	
	ОбластьШапка.Параметры.Период 			= ПредставлениеПериода(ПараметрыОтчета.НачПериода,ПараметрыОтчета.КонПериода);
	ОбластьШапка.Параметры.НачПок 			= "?";
	ОбластьШапка.Параметры.КонПок 			= "?";
	ОбластьШапка.Параметры.ЛС 				= ПараметрыОтчета.ЛицевойСчет;
	ОбластьШапка.Параметры.ФИО 				= ПараметрыОтчета.Абонент;
	ОбластьШапка.Параметры.Адрес 			= ПараметрыОтчета.АдресОбъекта;
	ОбластьШапка.Параметры.ТипПлиты 		= "?";
	
КонецПроцедуры

Процедура ЗаполнитьСправочно(ПараметрыОтчета,ОбластьСправочно)
			
	ЛС = РегистрыСведений.энргСостояниеЛС.СрезПоследних(ПараметрыОтчета.Дата,Новый Структура("Абонент", ПараметрыОтчета.Абонент));
	Если ЛС.Количество()> 0 Тогда
		ОбластьСправочно.Параметры.ДатаЛС = ЛС[0].Период;
		ОбластьСправочно.Параметры.ЗначЛС = ЛС[0].Состояние;
		
	КонецЕсли;
	
	КолВо = РегистрыСведений.энргКоличествоПрописанных.СрезПоследних(ПараметрыОтчета.Дата,Новый Структура("Абонент", ПараметрыОтчета.Абонент));
	Если КолВо.Количество()> 0 Тогда
		ОбластьСправочно.Параметры.ДатаПрописанных 	= КолВо[0].Период;
		ОбластьСправочно.Параметры.ЧислоПроп 		= КолВо[0].Количество;		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьУслуги(ПараметрыОтчета,ОбластьУслуга,ТабДок)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАктивностьТочекУчетаСрезПоследних.Абонент,
		|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета
		|ПОМЕСТИТЬ ВТ_Отбор
		|ИЗ
		|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(&Дата, Абонент = &Абонент) КАК энргАктивностьТочекУчетаСрезПоследних
		|ГДЕ
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргУслугиТочекУчетаСрезПоследних.Услуга,
		|	энргУслугиТочекУчетаСрезПоследних.Период КАК ДатаУслуги,
		|	энргУслугиТочекУчетаСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
		|			&Дата,
		|			Абонент В
		|					(ВЫБРАТЬ
		|						ВТ_Отбор.Абонент
		|					ИЗ
		|						ВТ_Отбор КАК ВТ_Отбор)
		|				И ТочкаУчета В
		|					(ВЫБРАТЬ
		|						ВТ_Отбор.ТочкаУчета
		|					ИЗ
		|						ВТ_Отбор КАК ВТ_Отбор)) КАК энргУслугиТочекУчетаСрезПоследних";
	
	Запрос.УстановитьПараметр("Абонент", 	ПараметрыОтчета.Абонент);
	Запрос.УстановитьПараметр("Дата", 		ПараметрыОтчета.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьУслуга.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьУслуга);
	КонецЦикла;	
		
	
КонецПроцедуры

Процедура ЗаполнитьПУ(ПараметрыОтчета,ОбластьПУ,ТабДок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргАктивностьТочекУчетаСрезПоследних.Абонент,
	|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета
	|ПОМЕСТИТЬ ВТ_Отбор
	|ИЗ
	|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(&Дата, Абонент = &Абонент) КАК энргАктивностьТочекУчетаСрезПоследних
	|ГДЕ
	|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПриборыТочекУчетаСрезПоследних.ПриборУчета,
	|	энргПриборыТочекУчетаСрезПоследних.Регистратор,
	|	энргПриборыТочекУчетаСрезПоследних.Абонент,
	|	энргПриборыТочекУчетаСрезПоследних.Период
	|ПОМЕСТИТЬ ВТ_ПУ
	|ИЗ
	|	РегистрСведений.энргПриборыТочекУчета.СрезПоследних(
	|			&Дата,
	|			Абонент В
	|					(ВЫБРАТЬ
	|						ВТ_Отбор.Абонент
	|					ИЗ
	|						ВТ_Отбор КАК ВТ_Отбор)
	|				И ТочкаУчета В
	|					(ВЫБРАТЬ
	|						ВТ_Отбор.ТочкаУчета
	|					ИЗ
	|						ВТ_Отбор КАК ВТ_Отбор)) КАК энргПриборыТочекУчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргМаксимальныеПоказания.Район,
	|	энргМаксимальныеПоказания.Абонент,
	|	энргМаксимальныеПоказания.ПриборУчета,
	|	энргМаксимальныеПоказания.Период,
	|	энргМаксимальныеПоказания.Регистратор,
	|	энргМаксимальныеПоказания.Разделитель,
	|	энргМаксимальныеПоказания.Показание
	|ПОМЕСТИТЬ НаборэнргМаксимальныеПоказания
	|ИЗ
	|	РегистрСведений.энргМаксимальныеПоказания КАК энргМаксимальныеПоказания
	|ГДЕ
	|	энргМаксимальныеПоказания.Район = &Район
	|	И энргМаксимальныеПоказания.Абонент В
	|			(ВЫБРАТЬ
	|				ВТ_Отбор.Абонент
	|			ИЗ
	|				ВТ_Отбор КАК ВТ_Отбор)
	|	И энргМаксимальныеПоказания.ПриборУчета В
	|			(ВЫБРАТЬ
	|				ВТ_ПУ.ПриборУчета
	|			ИЗ
	|				ВТ_ПУ КАК ВТ_ПУ)
	|	И энргМаксимальныеПоказания.Период <= &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборэнргМаксимальныеПоказания.Район,
	|	НаборэнргМаксимальныеПоказания.Абонент,
	|	НаборэнргМаксимальныеПоказания.ПриборУчета,
	|	МАКСИМУМ(НаборэнргМаксимальныеПоказания.Период) КАК Период
	|ПОМЕСТИТЬ МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания
	|ИЗ
	|	НаборэнргМаксимальныеПоказания КАК НаборэнргМаксимальныеПоказания
	|
	|СГРУППИРОВАТЬ ПО
	|	НаборэнргМаксимальныеПоказания.ПриборУчета,
	|	НаборэнргМаксимальныеПоказания.Абонент,
	|	НаборэнргМаксимальныеПоказания.Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания.Район,
	|	МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания.Абонент,
	|	МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания.ПриборУчета,
	|	МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания.Период,
	|	МАКСИМУМ(НаборэнргМаксимальныеПоказания.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ МаксимумРегистраторэнргМаксимальныеПоказания
	|ИЗ
	|	МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания КАК МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборэнргМаксимальныеПоказания КАК НаборэнргМаксимальныеПоказания
	|		ПО МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания.Район = НаборэнргМаксимальныеПоказания.Район
	|			И МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания.Абонент = НаборэнргМаксимальныеПоказания.Абонент
	|			И МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания.ПриборУчета = НаборэнргМаксимальныеПоказания.ПриборУчета
	|			И МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания.Период = НаборэнргМаксимальныеПоказания.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания.Период,
	|	МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания.Район,
	|	МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания.ПриборУчета,
	|	МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимумРегистраторэнргМаксимальныеПоказания.Район,
	|	МаксимумРегистраторэнргМаксимальныеПоказания.Абонент,
	|	МаксимумРегистраторэнргМаксимальныеПоказания.ПриборУчета,
	|	МаксимумРегистраторэнргМаксимальныеПоказания.Период,
	|	МаксимумРегистраторэнргМаксимальныеПоказания.Регистратор,
	|	МАКСИМУМ(НаборэнргМаксимальныеПоказания.Разделитель) КАК Разделитель
	|ПОМЕСТИТЬ МаксимумРазделитьэнргМаксимальныеПоказания
	|ИЗ
	|	МаксимумРегистраторэнргМаксимальныеПоказания КАК МаксимумРегистраторэнргМаксимальныеПоказания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборэнргМаксимальныеПоказания КАК НаборэнргМаксимальныеПоказания
	|		ПО МаксимумРегистраторэнргМаксимальныеПоказания.Район = НаборэнргМаксимальныеПоказания.Район
	|			И МаксимумРегистраторэнргМаксимальныеПоказания.Абонент = НаборэнргМаксимальныеПоказания.Абонент
	|			И МаксимумРегистраторэнргМаксимальныеПоказания.ПриборУчета = НаборэнргМаксимальныеПоказания.ПриборУчета
	|			И МаксимумРегистраторэнргМаксимальныеПоказания.Период = НаборэнргМаксимальныеПоказания.Период
	|			И МаксимумРегистраторэнргМаксимальныеПоказания.Регистратор = НаборэнргМаксимальныеПоказания.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	МаксимумРегистраторэнргМаксимальныеПоказания.Регистратор,
	|	МаксимумРегистраторэнргМаксимальныеПоказания.Район,
	|	МаксимумРегистраторэнргМаксимальныеПоказания.ПриборУчета,
	|	МаксимумРегистраторэнргМаксимальныеПоказания.Абонент,
	|	МаксимумРегистраторэнргМаксимальныеПоказания.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НаборэнргМаксимальныеПоказания.ПриборУчета,
	|	НаборэнргМаксимальныеПоказания.Абонент КАК Абонент,
	|	НаборэнргМаксимальныеПоказания.Показание
	|ПОМЕСТИТЬ ВТ_Показания
	|ИЗ
	|	НаборэнргМаксимальныеПоказания КАК НаборэнргМаксимальныеПоказания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимумРазделитьэнргМаксимальныеПоказания КАК МаксимумРазделитьэнргМаксимальныеПоказания
	|		ПО НаборэнргМаксимальныеПоказания.Район = МаксимумРазделитьэнргМаксимальныеПоказания.Район
	|			И НаборэнргМаксимальныеПоказания.Абонент = МаксимумРазделитьэнргМаксимальныеПоказания.Абонент
	|			И НаборэнргМаксимальныеПоказания.ПриборУчета = МаксимумРазделитьэнргМаксимальныеПоказания.ПриборУчета
	|			И НаборэнргМаксимальныеПоказания.Период = МаксимумРазделитьэнргМаксимальныеПоказания.Период
	|			И НаборэнргМаксимальныеПоказания.Регистратор = МаксимумРазделитьэнргМаксимальныеПоказания.Регистратор
	|			И НаборэнргМаксимальныеПоказания.Разделитель = МаксимумРазделитьэнргМаксимальныеПоказания.Разделитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НаборэнргМаксимальныеПоказания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимальнаяДатаРегистратораэнргМаксимальныеПоказания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимумРегистраторэнргМаксимальныеПоказания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МаксимумРазделитьэнргМаксимальныеПоказания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПУ.ПриборУчета КАК ПУ,
	|	ВТ_ПУ.Регистратор КАК РегистраторПрибора,
	|	ЕСТЬNULL(ВТ_Показания.Показание, 0) КАК КонПок,
	|	ВТ_ПУ.Период КАК ДатаПУ
	|ИЗ
	|	ВТ_ПУ КАК ВТ_ПУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Показания КАК ВТ_Показания
	|		ПО ВТ_ПУ.Абонент = ВТ_Показания.Абонент
	|			И ВТ_ПУ.ПриборУчета = ВТ_Показания.ПриборУчета";
	
	Запрос.УстановитьПараметр("Абонент", 	ПараметрыОтчета.Абонент);
	Запрос.УстановитьПараметр("Дата", 		ПараметрыОтчета.Дата);
	// << Колмыков Иван 06.06.2016
	Запрос.УстановитьПараметр("Район", 		ПараметрыОтчета.Абонент.Район);
	// >> Колмыков Иван 06.06.2016
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбластьПУ.Параметры.Заполнить(Выборка);	
		ТабДок.Вывести(ОбластьПУ);
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
